// Ex. I --> Филмовата академия на САЩ от 1929г. ежегодно раздава награди Оскар на грандиозна церемония.
// Организаторите искат да разберат колко са разходите по организирането на една такава церемония.
// Напишете програма, която изчислява какви разходи ще има академията по организацията на събитието,
// като знаете колко е наемът на залата, в която ще се проведе.

//• Статуетки – цената им е 30% по-малка от наема на залата
//• Кетъринг – цената му е 15% по-малка от тази на статуетките
//• Озвучаване – цената му е 1 / 2 от цената за кетъринг

// Да се отпечата на конзолата колко ще са разходите по организирането на церемонията.
// Сумата да бъде форматирана до втория знак след десетичния знак.

function oscarsCeremony(input){
    let rent = Number(input[0]);
    let totalCost = 0;

    let awardCost = rent - (rent * 0.3);
    let foodCost = awardCost - (awardCost * 0.15);
    let voicingCost = foodCost / 2;
    totalCost = (rent + awardCost + foodCost +voicingCost).toFixed(2);
    console.log(totalCost);

}

oscarsCeremony([3500])